K-OmegaSST-0AOA/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.6255;

boundaryField
{
    farfield
    {
        type            fixedValue;
        value           uniform 1.6255;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    aerofoil
    { 
       type            kqRWallFunction;
        value           $internalField;
    }
     front
    {
        type            empty;
    }
     back
    {
        type            empty;
    }
    
   
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
