K-OmegaSST-0AOA/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 33.2535;

boundaryField
{
   farfield
    {
        type            fixedValue;
        value           uniform 33.2535;
    }

    outlet
    {
       type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    aerofoil
    {
        type            omegaWallFunction;
        value            $internalField;
    }
     front
    {
        type            empty;
    }
     back
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
